#include <stdio.h>

/* Използвайте функцията getchar(), с която въвеждате текст от
клавиатурата, докато не подадете ЕОF(‘?’). Текстът има букви и
цифри. Принтирайте с putchar() само въведените букви. Използвайте
условните оператори, за да принтирате с putchar() само малките
букви от латинската азбука а - z и големите букви A-Z. */

int main(void){
    char c;

    while ((c = getchar()) != '?'){
        if ((c>64 && c<91) || (c>96 && c<123)){
            putchar(c);
        }
    }
    return 0;
}