#include <stdio.h>

/* Дефинирайте масив int с 10 елемента. Дефинирайте
пойнтер, който ще сочи към масива. Насочете пойнтера към масива. Нужно
ли е да използвате &? Какво представлява името на масива? Какво сочи?
Колко начина има за да изпишете насочването на пойнтера към масива.
Има ли разлика между тях? */

int main(void){

    int a[10] = {1, 2, 3, 4, 5, 6, 7, 8, 9, 10};
    int *pointer = NULL;
    pointer = a;

    printf("%d\n", pointer[3]);

    pointer = &a[5];

    printf("%d\n", pointer[3]);

    pointer = a[7];

    printf("%d\n", pointer);



    return 0;
}