#include <stdio.h>

/* С увеличаване на надморската височина температурата намалява с
около 0,5oC на всеки 100м. Нека приемем, че атмосферното налягане е нормално.
Ако се знае температурата (ХoC) на хижа Вихрен (1950 метра над морското
равнище), да се изчисли каква е температурата на връх Вихрен (2918 метра над
морското равнище). Ако се знае температурата (УoC) на връх Вихрен, да се изчисли
каква е температурата на хижа Вихрен.
Изход 1:
Ако атмосферното налягане е нормално и температурата на хижа Вихрен (1950м
н.м.р.) е ... oC , то температурата на връх Вихрен (2918м н.м.р.) е ... oC.
Изход 2:
Ако атмосферното налягане е нормално и температурата на връх Вихрен (2918м
н.м.р.) е ... oC , то температурата на хижа Вихрен (1950м н.м.р.) е ... oC. */

int main(void){




    return 0;
}