/* Прочетете за директивата #pragma once. Отговорете
дали тази директива е еквивалентна на гарда в упражнение 4 */

#pragma once е алтернатива на използваните гардове в предишната задача,
като има и няколко плюса спрямо гардовете.
Те са:  по-бързо компилиране, заради липсващата проверка за .h файлове;
        по-малко код;
Създателите на GCC препоръчват обаче #pragma once да не се използва,
защото е устарял метод, който може да доведе до нежелани неточности
с файлове с еднакво име в папка на програма. Препоръчват използвате
на гардовете и твърдят, че GCC е оптимизирал тяхното ползване и
скоростта по компилиране трябва да е същата като с #pragma once.
