#include <stdio.h>

/*  Напишете програма, която умножава 2 числа, като
използва пойнтер-и.
Пойнтер-ите не са страшни. Дефинират се като
тип *Х и се използват като *Х. Както променливите,
но със * отпред (и 1 наум!).
Продължение: Опитайте да умножите 2 променливи от
различен тип, използвайки пойнтери. */

int main(void){
    int a = 2;
    int b = 4;

    int *p_a = &a;
    int *p_b = &b;

    printf("a * b = %d\n", *p_a * *p_b);

    char c = 'c';
    char *p_c = &c;

    printf("a * c = %d\n", *p_a * *p_c);

    return 0;
}