#include <stdio.h>

/* Дефинираме променлива “а“, дефинираме
пойнтер, но още не му задаваме стойност. Отпечатайте
адреса на “а”. След това присвояваме стойност на
пойнтера, като внимаваме типовете на пойнтера и
променливата да са от един и същи тип. Отпечатваме
на екрана стойността на пойнтера с %р, стойността на
„а“ с %d, стойността на *ptr с %d. */

int main(void){
    int a;
    int *point;

    printf("a with address %p\n", &a);

    *point = &a;

    printf("a = %d, point = %d with address %p\n", a, *point, point);

    return 0;
}