#include <stdio.h>

/* Дефинирайте и инициализирайте променлива „а“.
Пойнтер към пойнтер към променлива.
Дефинирайте и инициализирайте пойнтер към нея.
Дефинирайте и инициализирайте пойнтер към първия пойнтер. Задайте
стойност на втория пойнтер 15.
Колко е стойността на променливата „а“?
Вземете бележката от масата, на нея пише в кое чекмедже (на скрина)
ще намерите бележката, на която пише къде е палтото (в гардероба);
Обърнете внимание на броя на звездичките! */

int main(void){
    int a = 1;
    int *p = &a;
    int **p2 = &p;

    **p2 = 15;

    printf("a = %d with address %p\n", a, &a);
    printf("p = %d with address %p\n", *p, p);
    printf("p2 = %d with address %p\n", **p2, p2);

    return 0;
}