#include <stdio.h>

/* Представете служителите във фирма в структура с членове:
пореден номер, име, презиме, фамилия, позиция, трудов стаж в години,
заплата в лева, указател към структурата, описващ неговия началник.
Напишете програма, която въвежда 10 служителя, които се съхраняват в
масив от описаните структури. Въвеждането на служителите може да стане
на два паса, първо въвеждане на всички данни без указателя към
началника и на втори пас, указване на всеки служител кой е неговият началник */

const int c_EmplSize = 10;

struct manager{
    char m_fName;
    char m_lName;

};

struct employee{
    int m_Id;
    char m_fName;
    char m_mName;
    char m_lName;
    char m_position;
    float m_wExp;
    float m_salary;
    struct manager *boss;
};



int main(void){




    return 0;
}